<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>unattended_install</key>
    <true/>
    <key>installer_type</key>
    <string>nopkg</string>
    <key>description</key>
    <string>Enables the Guest Account</string>
    <key>display_name</key>
    <string>Enable Guest</string>
    <key>name</key>
    <string>EnableGuest</string>
	<key>_metadata</key>
	<dict>
		<key>created_by</key>
		<string>grahamgilbert</string>
		<key>creation_date</key>
		<date>2014-02-14T15:56:04Z</date>
		<key>munki_version</key>
		<string>1.0.0.1864</string>
		<key>os_version</key>
		<string>10.9.1</string>
	</dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>production</string>
	</array>
	<key>minimum_os_version</key>
	<string>10.6.0</string>
	<key>postinstall_script</key>
	<string>#!/bin/bash

# Enables the Guest User based on OS version. Script based on https://github.com/sheagcraig/guestAccount/blob/master/guest_account

dscl='/usr/bin/dscl'
security='/usr/bin/security'

# Does guest already exist?
if [ -f /var/db/dslocal/nodes/Default/users/Guest.plist ]; then
	echo "Guest already created!"
	exit 0
else
	# Lion+ has a different procedure for enabling the guest account
	if [ "$(sw_vers | grep -o '10\.6')" != "" ]; then
		logger -s "$0: Not implemented"

		exit 0
	fi

	# Lion+ procedure
	if [ "$(sw_vers | grep -o '10\.[7-9]')" != "" ]; then
		logger "$0: Enabling 10.7/10.8/10.9 Guest"
		$dscl . -create /Users/Guest
		$dscl . -create /Users/Guest dsAttrTypeNative:_defaultLanguage en
		$dscl . -create /Users/Guest dsAttrTypeNative:_guest true
		$dscl . -create /Users/Guest dsAttrTypeNative:_writers__defaultLanguage Guest
		$dscl . -create /Users/Guest dsAttrTypeNative:_writers__LinkedIdentity Guest
		$dscl . -create /Users/Guest dsAttrTypeNative:_writers__UserCertificate Guest
		$dscl . -create /Users/Guest AuthenticationHint ''
		$dscl . -create /Users/Guest NFSHomeDirectory /Users/Guest

		# Give a little extra time for the password and kerberos to play nicely
		sleep 2
		$dscl . -passwd /Users/Guest ''
		sleep 2

		$dscl . -create /Users/Guest Picture "/System/Library/CoreServices/CoreTypes.bundle/Contents/Resources/UserIcon.icns"
		$dscl . -create /Users/Guest PrimaryGroupID 600
		$dscl . -create /Users/Guest RealName "Guest User"
		$dscl . -create /Users/Guest RecordName Guest
		$dscl . -create /Users/Guest UniqueID 600
		$dscl . -create /Users/Guest UserShell /bin/bash
		$security add-generic-password -a Guest -s com.apple.loginwindow.guest-account -D "application password" /Library/Keychains/System.keychain

		# This seems to be technically unnecessary; it controls whether the "Allow 
		# guests to log in to this computer" checkbox is enabled in SysPrefs 
		defaults write /Library/Preferences/com.apple.loginwindow GuestEnabled -bool TRUE

		# Profiles created with PM have these two keys, but they don't seem to do 
		# anything 
		#defaults write /Library/Preferences/com.apple.loginwindow DisableGuestAccount -bool FALSE
		#defaults write /Library/Preferences/com.apple.loginwindow EnableGuestAccount -bool TRUE

		logger -s "$0: Guest created"

		exit 0
	fi
fi</string>
	<key>uninstall_method</key>
	<string>uninstall_script</string>
	<key>uninstall_script</key>
	<string>#!/bin/bash

# Disables the Guest User. Script based on https://github.com/sheagcraig/guestAccount/blob/master/guest_account
dscl='/usr/bin/dscl'
security='/usr/bin/security'

$dscl . -delete /Users/Guest
$security delete-generic-password -a Guest -s com.apple.loginwindow.guest-account -D "application password" /Library/Keychains/System.keychain

# Also-do we need this still? (Should un-tick the box)
defaults write /Library/Preferences/com.apple.loginwindow GuestEnabled -bool FALSE

# Doesn't have an effect, but here for reference
#defaults write /Library/Preferences/com.apple.loginwindow DisableGuestAccount -bool TRUE
#defaults write /Library/Preferences/com.apple.loginwindow EnableGuestAccount -bool FALSE

logger -s "$0: Guest account disabled"</string>
	<key>version</key>
	<string>0.1</string>
    <key>installs</key>
	<array>
		<dict>
			<key>path</key>
			<string>/var/db/dslocal/nodes/Default/users/Guest.plist</string>
			<key>type</key>
			<string>file</string>
		</dict>
	</array>
</dict>
</plist>